'''
Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).
'''

#put your python code here
a = 1
print ( '*'*a)
a+=1
print ( '*'*a)
a+=1
print ( '*'*a)
a+=1
print ( '*'*a)
a+=1
print ( '*'*a)
a+=1
print ( '*'*a)
a+=1
print ( '*'*a)

