"""
Напишите программу, которая выводит текст:
"Python is a great language!", said Fred. "I don't ever remember having this much fun
before."
Примечание. Используйте конкатенацию строк.
"""

str1 = '"Python is a great language!"'
str2 = ', said Fred. '
str3 = '"I don' + "'" + 't ever remember having this much fun before."'

print(str1 + str2 + str3)
