"""Считайте натуральное число n.
Выведите на печать все числа от 0 до n, включительно, каждое с новой строки
"""

n = int(input())
i = 0
while i != n + 1:
    print(i)
    i = i + 1
