'''
    Три последовательных числа

    Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
Первое число вводит пользователь, остальные числа вычисляются в программе.

Формат входных данных
    На вход программе подается одно целое число.

Формат выходных данных
    Программа должна вывести три последовательно идущих числа в соответствии с условием задачи.
'''

# put your python code here
a = int(input())
b = a+1
c = b+1

print(a)
print(b)
print(c)
