"""
Число словами 🌶️
Напишите функцию number_to_words(num), которая принимает в качестве аргумента
натуральное число num и возвращает его словесное описание на русском языке.

Примечание 1. Считайте, что число 1≤num ≤99.

Примечание 2. Следующий программный код:

print(number_to_words(7))
print(number_to_words(85))

должен выводить:

семь
восемьдесят пять
"""


# объявление функции
def number_to_words(num):
    pass


# считываем данные
n = int(input())

# вызываем функцию
print(number_to_words(n))
