"""
Число словами 🌶️
Напишите функцию number_to_words(num), которая принимает в качестве аргумента
натуральное число num и возвращает его словесное описание на русском языке.

Примечание 1. Считайте, что число 1≤num ≤99.

Примечание 2. Следующий программный код:

print(number_to_words(7))
print(number_to_words(85))

должен выводить:

семь
восемьдесят пять
"""


# объявление функции
def number_to_words(num):
    str_rez = ''
    str_n = str(num)  # переводим число в строку
    list_dec = {
        1: "десять",
        2: "двадцать",
        3: "тридцать",
        4: "сорок",
        5: "пятьдесят",
        6: "шестьдесят",
        7: "семьдесят",
        8: "восемьдесят",
        9: "девяносто"
    }
    list_10 = {
        11: "одиннадцать",
        12: "двенадцать",
        13: "тринадцать",
        14: "четырнадцать",
        15: "пятнадцать",
        16: "шестнадцать",
        17: "семнадцать",
        18: "восемнадцать",
        19: "девятнадцать"
    }
    list_young = {
        1: "один",
        2: "два",
        3: "три",
        4: "четыре",
        5: "пять",
        6: "шесть",
        7: "семь",
        8: "восемь",
        9: "девять"
    }

    len_n = len(str_n)  # узнаем сколько разрядов в числе
    if len_n == 1:
        str_rez = list_young[num] + str_rez
    elif len_n == 2 and 1 <= (num // 10) <= 9 and num % 10 == 0:
        str_rez = list_dec[num // 10] + str_rez
    elif len_n == 2 and 11 <= num <= 19:
        str_rez = list_10[num] + str_rez
    elif len_n == 2 and num > 20:
        str_rez = (list_dec[num // 10]) + ' ' + list_young[num % 10] + str_rez

    return str_rez


# считываем данные
n = int(input())

# вызываем функцию
print(number_to_words(n))
