'''Задача
Это задача, похожа на ту, которой посвящен модуль. Она решается абсолютно теми же средствами, как и основная задача.

Написать программу, которая выводит сообщение "Я изучаю Python!".'''
print('Я изучаю Python!')