'''
Наибольшие числа 🌶️🌶️
На вход программе подается натуральное число n, а затем n различных натуральных чисел, каждое на отдельной строке. Напишите программу, которая выводит наибольшее и второе наибольшее число последовательности.

Формат входных данных
На вход программе подаются натуральное число n≥2, а затем n различных натуральных чисел, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести два наибольших числа, каждое на отдельной строке.
'''
n = int(input())
max1 = 0
max2 = 0
for i in range(n):
    i = int(input())
    if i > max1:
        max2 = max1
        max1 = i
    else:
        if i<max1 and i>max2:
            max2 = i
print(max1)
print(max2)