'''
Напишите программу, которая считывает три строки по очереди, а затем выводит их в той же последовательности, каждую на отдельной строчке.

Формат входных данных
На вход программе подаются три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в той же последовательности, каждую на отдельной строке.

Примечание. Для считывания текста используйте команду input(), для печати текста на экране используйте команду print().
'''

# put your python code here
str1 = input()
str2 = input()
str3 = input()

print (str1 +'\n'+ str2 +'\n'+ str3)