'''
    Большое число
Как известно, целые числа в языке Python не имеют ограничений, которые встречаются в других языках программирования.
 Напишите программу, которая считывает четыре целых положительных числа a, b,c и d и выводит на экран значение выражения
  a^b + c^d.

Формат входных данных
    На вход программе подаётся четыре целых положительных числа a, b, c и d , каждое на отдельной строке в указанном порядке.

Формат выходных данных
    Программа должна вывести значение a^b + c^d.
'''
# put your python code here
a = int(input())
b = int(input())
c = int(input())
d = int(input())

rezult = a**b + c**d
print(rezult)